II/collins_with_kernel/FENE_P/tutorial/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solvers
{


    p
    {
	solver          GAMG;
        tolerance       1e-8; //1e-08
        relTol          0;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 120;
        agglomerator    faceAreaPair;
        mergeLevels     1;
	minIter         2;
    }

    pFinal
    {
        solver		PCG;
        preconditioner
	{
		preconditioner          GAMG;
        	tolerance       1e-8; //1e-08
        	relTol          0;
		nVcycles	2;        	
		smoother        DICGaussSeidel;
        	nPreSweeps      2;
        	nPostSweeps     2;
        	nFinestSweeps   2;
        	cacheAgglomeration true;
        	nCellsInCoarsestLevel 120;
        	agglomerator    faceAreaPair;
        	mergeLevels     1;
		minIter         2;	
	}
	
	tolerance	1e-12;
	relTol		0;
	maxIter		20;
    }


    U
    {
	solver		smoothSolver;
	smoother	symGaussSeidel;
	tolerance	1e-12;
	relTol		0;
	nSweeps		2;
    }

    "(eig1|eig2|eig3|v11|v21|v13|v23|VECS)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }


}

PISO
{
    nCorrectors     5;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}



// ************************************************************************* //
